Tekla Open API Reference for Tekla Structures 2025
BaseWeld.WeldNumber Property
 Gets the weld number.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int WeldNumber { get; }
Public ReadOnly Property WeldNumber As Integer
	Get
Property Value
Type: Int32
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace